{
    "LoreAnswers": {
        "5": "You can call us Travelers. We protect a realm known as Dragon's Crossing. The affairs of men, elves, and other creatures do not interest us so long as they honor our only law: stay out of Dragon's Crossing. Otherwise, we are happy to observe, and even offer occasional advice.",
        "6": "The disaster that befell Aedos is the result of the hubris of the powerful. It is their folly that caused your removal from your previous realm. It was both accidental and intentional. The nexus that some tried to touch and steal from is dangerous and unpredictable, though the tragedy that Aedos has suffered was preventable. Every area you venture into is from another world that dared interfere with Dragons Crossing.",
        "7": "There is much you should be cautious of in the world you call Horizon. First in your mind and closest to Aedos, and a grand threat, is Abaddon. He ruminates not far from here, enslaving the weak-willed and those that lust for power. The elves nearby have been scattered as a result of their conflict with him. Do not cross him lightly.",
        "8": "We travel. We go from place to place, keeping a general eye on the powerful and the adventurous, making sure they do not touch Dragons Crossing. There are others of my order around Horizon, and each of us are somewhat territorial. There is rarely a need to ever have two of us in the same area.",
        "9": "Abaddon, the lord of the Dark Tower, is at least partially responsible. I do not specifically know who else, though I suspect there are many others who share blame. I think that even Aedos itself has some level of responsibilty for the calamity from which you suffer. Abaddon, and others, have touched that which should be left unmolested.",
        "10": "A fellow lover of history? The prairies here have fertile soil. An age ago, they were cultivated farmland. The place where Aedos now sits was the site of a large city--since destroyed and its inhabitants scattered. The forest in the distance was the ancestral home of a tribe of elves and other fey creatures, but they are also scattered, and many corrupted by Abaddon, Lord of the Dark Tower, and many more still simply taking advantage of the chaos that Abaddon created...along with the sudden appearance of Aedos.",
        "11": "In an age long forgotten, the high elves lived here. We had communion with them and taught them them many things. After decades of love and trust we bestowed upon them the magic to shape the land. We made a grave mistake.",
        "12": "I am connected to the soul of this land. Even the dark creatures that prowl in this corrupted area know and respect me. The creatures who forget learn a harsh lesson.",
        "13": "Abbadon has always dreamt of empowering this land, and himself. He is a wonderful philosopher, and a brilliant magicker. When we worked together, it felt like nothing could stop us. Unfortunately, he combines his talents with an astounding level of arrogance. When it became clear that he was attempting to destabalize our aeons long agreement we had to part ways with him, and exiled him to Horizon. I believe he still intends to empower this land, but at what cost?",
        "14": "Yes. While he seeks to subvert the world itself to his whims, the creatures that inhabit Horizon either become subject to him or must fight against him. There is, unfortunately, no middle ground. While his influence does not grow quickly, it does not need to. He has as much time as he needs. Mortals, in contrast, must be wary of the insidious spread of his desires.",
        "15": "Abaddon and his most trusted acolyte, Dreadsire, raised these mountains as a test of their skill and coordination. This area was once a relatively flat desert. They bent the world to their will and then discarded it.",
        "16": "There is a strange justice to the universe. Aedos would not have been transported to Horizon without there being a cause. While I did not witness the event or cause it, I can speculate that a group of mortal magickers made contact with Abaddon, Dragons' Crossing, or both.",
        "17": "I will admit you are...promising, Child of Aedos. I am interested in seeing your story play out, and seeing you challenge Abaddon. I cannot, and will not, challenge Abaddon, for he was my brother for millenia and his wrongs do not target me directly. This may seem selfish, and perhaps I am, but it is up to those that he affects to enact change and resist him.",
        "18": "Power, pure and simple. There is something magical about civilization--a magic unlike the flash and sizzle you might see in combat. Civilization generally teaches us to at least pretend to honor each other, and to follow certain rules for a common good. Abaddon promises those that follow him freedom from consequence and the power to subjugate others. This is a tempting offer for any sentient creature.",
        "19": "Abaddon's goal is the subjugation of Horizon, and through Dragon's Crossing, all worlds. You must not let his promisings of power sway you from your love of free will, evident in the spirit of adventure you've shown in getting from Aedos to the Dark Tower.",
        "20": "Cocytus is not as involved as I am, but he still does not want those that may not be strong enough to suffer unnecessarily. Think of it as a small guard rail on your journey. You may walk off the path, of course, but I do not want you to fall into brambles.",
        "21": "This is a thicket that I suspect has attracted creatures that, on their own world, would be rare, or non-existent. They have come into existence here, and gathered where the magic of the land has become twisted.",
        "22": "There are many from Aedos that wander Horizon as you do, seeking adventure, loot, and sometimes even glory to be the one to unseat Abaddon, and not simply an echo of him. Even his echoes are dangerous, and must be defeated.",
        "23": "I was not directly involved with this--but I can tell you that the echo-deities you fight in your travels here were once so powerful that they controlled their entire world. They must have meddled in some way with Dragon's Crossing to be brought here.",
        "24": "I admit I am more involved than most of my kin, because I care about the shorter-lived, frantic lives you lead. I also miss my brother, Abaddon, truth be told, and I hope that he will turn back once someone more...mortal risks everything to defeat him.",
        "25": "Abaddon is my brother, but must be resisted. We must not let the people of this world, good or evil, fall under his subjugation. He intends this world to be used as a catalyst of sorts, to the detriment of us all."
    }
}